{
  "main": {
    "name":"Winnie Wangui Kariuki",
    "occupation":"Software Engineer",
    "description":"I am a passionate Software Engineer with 2 years of experience in full-stack web development and Software Quality Assurance who enjoys working in diverse engineering teams. I not only have an interest in writing code that works but also ensuring that the code I write is of high standard by constantly testing the code and also  testing the user experience . I enjoy writing unit tests as well as end to end testing.",
    "image":"professional.png",
    "bio":"I am a passionate Software Engineer with 2 years of experience in full-stack web development and Software Quality Assurance who enjoys working in diverse engineering teams. I not only have an interest in writing code but also ensuring that the code I write is of high standards by constantly testing the code and also the user experience. I enjoy writing unit tests as well as an end to end testing.",
    "contactmessage":"Kindly reach out to me through the contacts below if you need any of my services",
    "email": "winniekariuki48@gmail.com/ winniekariuki07@gmail.com",
    "phone": "+254707453758",
    "address":{
      "city":"Nairobi"
    },
    "resumedownload":"https://drive.google.com/file/d/1GaUP0jxKUsgpgiqls_nVYMiA08fkxxCe/view?usp=sharing",
    "social":[
      {
        "name":"twitter",
        "url":"https://twitter.com/WinnieKariuk",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/winnie-kariuki-2a0746155/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/winniekariuki17/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/winniekariuki",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"Multimedia University",
        "degree":"Bachelors of Science in Computer Technology",
        "description":"Multimedia University has equipped me with the foundation knowledge and skills required in the field of Programming, Hardware Maintenance and Networking. I am currently working as a Software Engineer at Andela Kenya"
      }
    ],
    "work":[
      {
        "company":"Powered by People",
        "title":"Software Engineer ",
        "years":"February 2020 - May 2020",
        "description":"My main role in powered by people was to develop a business platform that plans, manages, and tracks decentralized manufacturing as well as trace the supply chain. I was actively involved in both backend and frontend but mainly specialized in frontend. During my time at powered by people, I have managed to deliver some of the critical features such as creating a dashboard with analysis of the user’s data, reading and writing to external data file formats such as  CSV files. I also developed a Gantt chart, bar chart, and line chart visualization feature using google charts. Working in Powered by people has given me the experience of working at a very high level and powerful product while focusing on the user’s satisfaction hence growing my skills and  efficiency in problem-solving."
      },
      {
        "company":"Andela Limited Kenya",
        "title":"Software Engineer ",
        "years":"February 2019 - October 2019",
        "description":"During this period I worked in Andela, I worked on a real-life product called Activo which is used by Andela to manage their assets. I worked on several features as a front end engineer. They include, the designing of the Asset History and Asset Repair Log, displaying the actual data of asset history and repair log, editing of asset categories and subcategories, writing integrated tests for the creation of asset categories, fixing smart bugs, etc. Working in Activo gave me the experience and skills of delivering high-quality code while working and collaborating in the large engineering team. I was also part of a team that worked on a project called Author's Haven that included a platform that would allow users to write articles, read the articles and follow one another. I worked as both front end engineer and back end engineer. In this project, I got experience in working with restful API and Postgres as a backend developer."
      }
    ],
    "skills":[
      {
        "name":"Git",
        "level":"80%"
      },
      {
        "name":"Redux",
        "level":"90%"
      },
      {
        "name":"ReactJs",
        "level":"90%"
      },
      {
        "name":"CSS",
        "level":"80%"
      },
      {
        "name":"HTML5",
        "level":"80%"
      },
      {
        "name":"Python Django",
        "level":"70%"
      },
      {
        "name":"Unit testing",
        "level":"80%"
      },
      {
        "name":"Intergrated Testing",
        "level":"80%"
      },
      {
        "name":"TypeScript",
        "level":"80%"
      },
      {
        "name":"React Hooks",
        "level":"80%"
      },
      {
        "name":"Material UI",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"E-commerce-site",
        "category":"A user can see all the products available, add product to cart, change quantity product in cart, empty cart, remove cart item and search product.",
        "image":"Screenshot (1).png",
        "url":"https://flamboyant-montalcini-f8bb43.netlify.com/"
      },
      {
        "title":"My Shop",
        "category":"A user can view all products available in the application.",
        "image":"Screenshot (5).png",
        "url":"https://ecommerce-cdb85.firebaseapp.com/URL"
      },
      {
        "title":"My store",
        "category":"Store Manager is a web application that helps store owners manage sales and product inventory records. This application is meant for use in a single store",
        "image":"storemanager.jpg",
        "url":"https://github.com/winniekariuki/Mystore-manager"
      }
    ]
  }
}
